M = [['+', '+', '+', '+', '+'],
     ['+', '+', '+', '+', '+'],
     ['+', '+', '+', '+', '+'],
     ['+', '+', '+', '+', '+'],
     ['+', '+', '+', '+', '+']]
# i에 대해 M[i] 만 바뀌도록 하자
# 첫 번째에는 첫 번째 '+' 만 '#'으로 바뀌도록 한다.
# 풀어놓고 답이 왜 맞게 나온지 모름...

for i in range(5):
    for j in range(5):
        if i == j:
            M[i][j] = '#'
            L = ''.join(M[i])
    print(L)


# for i in range(5):
#     for j in range(5):
#         if i == j:
#             print('#', end = '')
#         else:
#             print('+', end = '')
#     print()